combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0/pyrolysisRegion/wood
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/pyrolysisRegion";
    object      wood;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    coupledWall_top
    {
        type            zeroGradient;
    }
    region0_to_pyrolysisRegion_coupledWall
    {
        type            zeroGradient;
    }
    oneDEmptyPatch
    {
        type            empty;
    }
}


// ************************************************************************* //
